Revit 2026 API

# FamilyItemFactoryNewSymbolicCurve Method

---

Create a symbolic curve in an Autodesk Revit family document.

**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public SymbolicCurve NewSymbolicCurve(
	Curve curve,
	SketchPlane sketchPlane
)
```
```vb
Public Function NewSymbolicCurve (
	curve As Curve,
	sketchPlane As SketchPlane
) As SymbolicCurve
```
```cpp
public:
SymbolicCurve^ NewSymbolicCurve(
	Curve^ curve,
	SketchPlane^ sketchPlane
)
```
```fsharp
member NewSymbolicCurve :
        curve : Curve *
        sketchPlane : SketchPlane -> SymbolicCurve
```

#### Parameters

curve Curve
    The geometry curve of the newly created symbolic curve.
sketchPlane SketchPlane
    The sketch plane for the symbolic curve.

#### Return Value

SymbolicCurveThe newly created symbolic curve.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when argument is . |
| InvalidOperationException | Thrown when regeneration failed. Thrown when symbolic curve creation failed. |

#### Reference

FamilyItemFactory Class

Autodesk.Revit.Creation Namespace